#include <windows.h>
#include <d3d9.h>
#include <d3dx9.h>
#include "Logger.h"
#include "XStr.h"
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib,"d3dx9.lib")

D3DVIEWPORT9 Viewport;
D3DVIEWPORT9 g_ViewPort;
LPD3DXLINE pLine    = NULL;
LPDIRECT3DDEVICE9 npDevice; 
LPDIRECT3DDEVICE9 oDevice = NULL;
LPD3DXFONT fName	= NULL;
LPD3DXFONT fSmall	= NULL;
LPD3DXFONT Title    = NULL;
DWORD TeamColor;
D3DVECTOR Player;
D3DVECTOR HeadPos;
D3DVECTOR PlayerScaled;
D3DVECTOR HeadScaled;
D3DVECTOR BonePos;
BOOL Create;
char *Moptfolder        []  = {"Open", "Close"}; // Buat on Off nya
//char *Moptonoff         []  = {"OFF", "ON"};
char *MoptGExit         []  = {"OFF", "END"};
char *MoptGhost         []  = {"OFF", "L-ALT"};
char *MoptReplace       []  = {"OFF", "Barett M82A1", "Kriss SVD", "Famas G2 M203", "SPASS-15 MSC", "Cheytac M200", "P90 Ext D", "M1887 D", "Dual UZI Sil.SL", "P90 MCS", "AK47 FC", "AUG A3 G"};
char *MoptBiar          []  = {"OFF", "HOME"};
char *MoptColor         []  = {"OFF", "Merah", "Kuning", "Hijau", "Orange", "Biru", "Hitam"};
char *Mopttarget        []  = {"Head", "Body"};
#define RED				D3DCOLOR_ARGB(255, 245, 000, 000)
#define WHITE			D3DCOLOR_ARGB(255, 255, 255, 255)
#define YELLOW			D3DCOLOR_ARGB(255, 255, 255, 000) 
#define GREEN			D3DCOLOR_ARGB(255, 000, 255, 000)
#define ORANGE			D3DCOLOR_ARGB(255, 255, 125, 000)
#define BLACK			D3DCOLOR_ARGB(150, 000, 000, 000)
#define BLUE			D3DCOLOR_ARGB(255, 19, 84, 199) 
#define DEEPSKYBLUE     D3DCOLOR_ARGB(255, 30, 144, 255) //
#define CHOCOLATE2      D3DCOLOR_ARGB(255, 238, 118, 33) //
#define GOLD2			D3DCOLOR_ARGB(255, 238, 201, 0)  //
#define SQUA			D3DCOLOR_ARGB(255, 0, 255, 255)  //
#define DARKGREY        D3DCOLOR_ARGB(255,62,62,62)      //
#define Functions       D3DCOLOR_ARGB(255,26,115,145)//
#define MenuGreen       D3DCOLOR_ARGB(255,43,119,64) //
#define MenuGREY        D3DCOLOR_ARGB(255,30,30,30)  //
#define FUCK_ON			D3DCOLOR_ARGB(255,14,159,47) //
#define FUCK_OFF		D3DCOLOR_ARGB(255,62,120,167)//


D3DXVECTOR3 vStart,vEnd;
D3DXVECTOR3 vvStart,vvEnd;
D3DXVECTOR3 vStart2,vEnd2;
D3DXVECTOR3 vvStart2,vvEnd2;
D3DXVECTOR3 vStart3,vEnd3;
D3DXVECTOR3 vvStart3,vvEnd3;
D3DXVECTOR3 vStart4,vEnd4;
D3DXVECTOR3 vvStart4,vvEnd4;
D3DXVECTOR3 vStart5,vEnd5;
D3DXVECTOR3 vvStart5,vvEnd5;
D3DXVECTOR3 vStart6,vEnd6;
D3DXVECTOR3 vvStart6,vvEnd6;
D3DXVECTOR3 vStart7,vEnd7;
D3DXVECTOR3 vvStart7,vvEnd7;
D3DXVECTOR3 vStart8,vEnd8;
D3DXVECTOR3 vvStart8,vvEnd8;
D3DXVECTOR3 vStart9,vEnd9;
D3DXVECTOR3 vvStart9,vvEnd9;
D3DXVECTOR3 vStart10,vEnd10;
D3DXVECTOR3 vvStart10,vvEnd10;
BYTE Byte [40];
class PlayerInfo;
class RenderContext;
class RenderData;
class CInMouse;
class CGameBase;
class CBonesContext;
class CBone;

LPD3DXFONT pFonts;
DWORD dwGFX			= (DWORD)GetModuleHandle("i3GfxDx.dll");
RenderContext *pRC	= (RenderContext*)(dwGFX + 0x1AD2F0);

class RenderData
{
public:
	char unknown0[2240];
	D3DXMATRIX ViewMatrix;
	D3DXMATRIX ProjMatrix;
	D3DXMATRIX World; 
	D3DXMATRIX WorldView[80];
};

class RenderContext
{
public:
	RenderData* pRenderData; 
	char unknown4[912];
	D3DXVECTOR3 bone;
	D3DXVECTOR3 bone1;
	D3DXVECTOR3 bone2;
};

extern RenderContext *pRC;


class CBone
{
public:
	D3DXMATRIX BoneMatrix;
};


class CBonesContext
{
public:
	char   Unk[0xC8];
	CBone* BoneData;
};

// Pasang Bom Sembarang//

class cGameStageInfo
{
public: 
char _pad1[0x4CF58];//0x0 
D3DXVECTOR3 BombPositionA;//0x238 
D3DXVECTOR3 BombPositionB;//0x244 
char _pad2[0xF4];//0x250 
float BombFloorOnMiniMap_A;
float BombFloorOnMiniMap_B;
float RespawnTime;//0x344 
float RespawnTime4vs4;//0x348 
float InvicibleTime;//0x34C 
float InvicibleTime4vs4;//0x350 
};
class cGameBases
{
public:
char _pad1[0x4CF58];
cGameStageInfo* StageInfo;
};
struct D3DTLVERTEX
{
	float fX;
	float fY;
	float fZ;
	float fRHW;
	D3DCOLOR Color;
	float fU;
	float fV;
};

class CGameBase
{
public:
	char           Unk[0x55C];
	CBonesContext* Bones;
};


struct CHealth
{
 float CurHP;
};

struct CPlayers
{
    float yaw;
    float pitch;
    D3DXVECTOR3 pos;
	char unkno8[2304];
};

class Bone
{
public:
D3DXMATRIX m_Bone;
};

class GM;

class GM
{
public:
BYTE iRank; //0x0000
char _0x0001[15];
WORD iHack; //0x0010
};//Size=0x0012

struct CNames
{
    char szNames[33];
};

class CGameCharaBoneContext
{
public:
char nop[0xC8];
Bone* m_Bone;
};


class CGameCharaBase
{
public:
char nop[0x55C];
CGameCharaBoneContext* m_BoneContext;
};


struct CTeam
{
	BYTE iTeam;
};


class CNick
{
public:
BYTE bVal;
};


class Gendeng
{
public:
	DWORD Module;

};


class CDWORD
{
public:
DWORD dwRes;
};


class CWORD
{
public:
WORD wRes;
};


class CBYTE
{
public:
BYTE bRes;
};

class CSlotz;
class CSlotz
{
public:
DWORD Host;
DWORD Slot;
};
class cHIT
{
public:
char _0x0000[116];
DWORD Index;
CDWORD setHitType[64];
char _0x0178[256];
CWORD setHitWho[64];
CBYTE setHitPart[64];
CWORD setHitDamage[64];
CBYTE setCriticalFlag[64];
CBYTE setHelmetFlag[64];
CDWORD setNetSlotInex[64];
CDWORD setWeaponClass[64];
CBYTE setWeaponNumber[64];
CDWORD setWeaponUsage[64];
char _0x0778[768];
CDWORD setDeathType[64];
